# 6.데이터 선택(기본)

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

## column 선택(label)

In [2]:
df[['이름','키']] #선택해서 가져오기

       이름    키
지원번호
1번    채치수  197
2번    정대만  184
3번    송태섭  168
4번    서태웅  187
5번    강백호  188
6번    변덕규  202
7번    황태산  188
8번    윤대협  190

## column 선택(컬럼의 이름이 아닌 정수 index로)

In [3]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [4]:
df.columns[0]

'이름'

In [5]:
df.columns[2]

'키'

In [9]:
df[df.columns[0]] #그냥 0넣으면 존재하지 않으므로 에러->df.columns[0]=='이름'이었으므로 이름값들 보여줌

지원번호
1번    채치수
2번    정대만
3번    송태섭
4번    서태웅
5번    강백호
6번    변덕규
7번    황태산
8번    윤대협
Name: 이름, dtype: object

In [10]:
#데이터가 너무 방대한대 최신 업데이트된 맨 뒤의 열만 가지고 오고 싶은경우
df[df.columns[-1]]

지원번호
1번        Python
2번          Java
3번    Javascript
4번           NaN
5번           NaN
6번             C
7번        PYTHON
8번            C#
Name: SW특기, dtype: object

## 슬라이싱
[]는 ''이 아닐 시 행을 가져옴

In [12]:
# 영어 열 중에서도 5번째 일부의 데이터만 가져오기
df['영어'][:5]

지원번호
1번    85
2번    35
3번    75
4번    60
5번    20
Name: 영어, dtype: int64

In [13]:
df[['이름','키']][:3] #처음 3명의 이름, 키 정보

       이름    키
지원번호
1번    채치수  197
2번    정대만  184
3번    송태섭  168

In [16]:
df[3:] #4번부터 끝까지 행 가져옴

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
4번    서태웅  북산고  187   40   60  70  75  80     NaN
5번    강백호  북산고  188   15   20  10  35  10     NaN
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#